In [6]:
!pip install pandas

Collecting pandas
  Using cached pandas-2.2.2-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\neela\onedrive\desktop\datascientists\full-stack-data-science\.venv\lib\site-packages (from pandas) (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\neela\onedrive\desktop\datascientists\full-stack-data-science\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\neela\onedrive\desktop\datascientists\full-stack-data-science\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.2-cp312-cp312-win_amd64.whl (11.5 MB)
Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [7]:
import pandas as pd

In [9]:
## Series
df=pd.Series([1,'Neel'])
print(df)

0       1
1    Neel
dtype: object

In [11]:
print(type(df))

<class 'pandas.core.series.Series'>

In [12]:
## create sereis from dict elements.
data={'a':1,"b":12,"c":34}
series_dict=pd.Series(data)
print(series_dict)

a     1
b    12
c    34
dtype: int64

In [13]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [14]:
## Dataframe

data={
    'Name':['john','ram','arun'],
    'Age':[34,23,24],
    'city':['Mumbai','Chennai','Chennai']
}

df=pd.DataFrame(data)
df

   Name  Age     city
0  john   34   Mumbai
1   ram   23  Chennai
2  arun   24  Chennai

In [28]:
## Create a dataframe from list of dictionary

data=[
    {'Name':'Kish','Age':34,'gender':'M'},
    {'Name':'John','Age':24,'gender':'M'},
    {'Name':'Mutin','Age':30,'gender':'F'}
]
df=pd.DataFrame(data)
df

    Name  Age gender
0   Kish   34      M
1   John   24      M
2  Mutin   30      F

In [22]:
df['Name']

0     Kish
1     John
2    Mutin
Name: Name, dtype: object

In [23]:
# Row location
df.loc[0]

Name      Kish
Age         34
gender       M
Name: 0, dtype: object

In [32]:
# index location
df.iloc[0][0]

C:\Users\neela\AppData\Local\Temp\ipykernel_7536\768488974.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Kish'

In [36]:
## Accesing a specific elements.

df.at[1,'Age']

np.int64(24)

In [37]:
## Adding the column
df['salary']=[2000,3000,3000]
df

    Name  Age gender  salary
0   Kish   34      M    2000
1   John   24      M    3000
2  Mutin   30      F    3000

In [39]:
## Deleting the column
df.drop(columns='salary',axis=1,inplace=True)
df

    Name  Age gender
0   Kish   34      M
1   John   24      M
2  Mutin   30      F

In [46]:
##Adding age
df['Age']=df['Age']+1
df

    Name  Age gender
0   Kish   40      M
1   John   30      M
2  Mutin   36      F

In [48]:
## Drop based on row
df.drop(0,inplace=True)
df

    Name  Age gender
1   John   30      M
2  Mutin   36      F

In [49]:
df=pd.read_csv(r'C:\Users\neela\OneDrive\Desktop\DataScientists\Full-Stack-Data-Science\10-DataAnalysis\sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [50]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [51]:
df.shape

(240, 9)

In [52]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [ ]:
df